#+title: Queueing theory assignment: Applications of Sakasegawa's formula
#+author: Nicky D. van Foreest
#+date: 2022:01:19

#+STARTUP: indent
#+STARTUP: overview
#+PROPERTY: header-args:shell :exports both
#+PROPERTY: header-args:emacs-lisp :eval no-export
#+PROPERTY: header-args:python :eval no-export
# +PROPERTY: header-args:python :session  :exports both   :dir "./figures/" :results output

#+include: preamble.org

** Check work

Again, first we need to check that our (implementtion of the) formulas for $\E S$ and $\V S$ are correct.

#+begin_src python
import numpy as np
from scipy.stats import expon

np.random.seed(3)

labda = 3
mu = 2 * labda
ES0 = 1 / mu
labda_f = 2
ER = 0.5
num = 10000

S0 = np.random.exponential(scale=ES0, size=num + 1)
N = np.random.poisson(labda_f * ES0, len(S0))
R = expon(scale=ER)
S = np.zeros_like(S0)
for i in range(len(S0)):
    S[i] = S0[i] + R.rvs(N[i]).sum()

A = 1 / (1 + labda_f * ER)
ES = ES0 / A
print(ES, S.mean(), S0.mean() + N.mean() * R.mean())

C02 = 1
Cs2 = C02 + 2 * A * (1 - A) * ER / ES
print(Cs2, S.var() / (S.mean() ** 2))
#+end_src

#+RESULTS:
: 0.3333333333333333 0.3353397655570448 0.3314315808219902
: 1.75 1.8072807575060008

#+begin_exercise
Run this code, and check the result. Then chance ~num~ to 100000 to see that the estimate improves.
#+end_exercise

#+begin_exercise
Explain how we compute ~S[i]~.
#+end_exercise

